In [1]:
import pandas as pd
import numpy as np
print(pd.__version__)
print(np.__version__)

1.0.1
1.18.1

In [4]:
n_rows = 5
n_cols = 2
cols = ['bil_pecahan','bil_bulat']
df = pd.DataFrame(np.random.randint(1,20, size=(n_rows, n_cols)),
                 columns=cols)
df['bil_pecahan'] = df['bil_pecahan'].astype('float')
df.index = pd.util.testing.makeDateIndex(n_rows,freq='H')
df = df.reset_index()
df['teks'] = list('ABCDE')
df

/home/sammidev/anaconda3/lib/python3.7/site-packages/pandas/util/__init__.py:12: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

                index  bil_pecahan  bil_bulat teks
0 2000-01-01 00:00:00         11.0         12    A
1 2000-01-01 01:00:00         14.0          2    B
2 2000-01-01 02:00:00         17.0         15    C
3 2000-01-01 03:00:00          6.0         10    D
4 2000-01-01 04:00:00         13.0          3    E

In [5]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int64
teks                   object
dtype: object

# memilih kolom tipe numeric
df.select_dtypes(include='number')

In [6]:
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0         11.0         12
1         14.0          2
2         17.0         15
3          6.0         10
4         13.0          3

In [7]:
df.select_dtypes(include='float')

   bil_pecahan
0         11.0
1         14.0
2         17.0
3          6.0
4         13.0

In [8]:
df.select_dtypes(include='int')

   bil_bulat
0         12
1          2
2         15
3         10
4          3

In [9]:
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

In [10]:
df.select_dtypes(include='datetime')

                index
0 2000-01-01 00:00:00
1 2000-01-01 01:00:00
2 2000-01-01 02:00:00
3 2000-01-01 03:00:00
4 2000-01-01 04:00:00

In [11]:
df.select_dtypes(include='number','float','datetime')

SyntaxError: positional argument follows keyword argument (<ipython-input-11-963b9cfd54c6>, line 1)

In [12]:
df.select_dtypes(include='number', 'float')

SyntaxError: positional argument follows keyword argument (<ipython-input-12-5dc475ede2d5>, line 1)

In [13]:
df.select_dtypes(include=['number','float'])

   bil_pecahan  bil_bulat
0         11.0         12
1         14.0          2
2         17.0         15
3          6.0         10
4         13.0          3